hjc2000/my-stm32-f103-hal-project-template/jc-stm32-lib/src/Clock.c
#include"Clock.h"
#include<stm32f1xx_hal_cortex.h>

uint8_t systick_count_flag()
{
	uint32_t masked = SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk;
	return masked >> SysTick_CTRL_COUNTFLAG_Pos;
}

uint8_t systick_clock_source()
{
	uint32_t masked = SysTick->CTRL & SysTick_CTRL_CLKSOURCE_Msk;
	return masked >> SysTick_CTRL_CLKSOURCE_Pos;
}

uint8_t systick_clock_source_is_hclk()
{
	return systick_clock_source();
}

uint8_t systick_clock_source_is_hclk_div8()
{
	return !systick_clock_source();
}

void systick_set_clock_source(uint8_t div8)
{
	/* 其实 HAL 中已经有一个 HAL_SYSTICK_CLKSourceConfig 函数用来干这个事了。
	* 只不过 HAL_SYSTICK_CLKSourceConfig 函数不太清晰。
	*/
	if (div8)
	{
		// 清 0 表示使用 8 分频
		SysTick->CTRL &= ~SYSTICK_CLKSOURCE_HCLK;
	}
	else
	{
		// 置 1 表示不分频，让 HCLK 直接作为 Systick 的时钟源。
		SysTick->CTRL |= SYSTICK_CLKSOURCE_HCLK;
	}
}

uint32_t systick_clock_source_freq()
{
	uint32_t hclk_freq = HAL_RCC_GetHCLKFreq();
	if (systick_clock_source_is_hclk_div8())
	{
		return hclk_freq / 8;
	}

	return hclk_freq;
}

uint32_t systick_reload_num()
{
	uint32_t masked = SysTick->LOAD & SysTick_LOAD_RELOAD_Msk;
	return masked >> SysTick_LOAD_RELOAD_Pos;
}

uint32_t systick_current_value()
{
	uint32_t masked = SysTick->VAL & SysTick_VAL_CURRENT_Msk;
	return masked >> SysTick_VAL_CURRENT_Pos;
}

void systick_nop_loop_delay_tick(uint32_t tick_count)
{
	/* 这里不禁用操作系统的调度。不要让此函数耦合性太强。
	* 如果需要的话，禁用操作系统的调度这个操作应该放到本函数外，调用者自己执行。
	*/
	uint32_t old_tick = systick_current_value();
	uint32_t total_tick = 0;
	while (1)
	{
		uint32_t now_tick = systick_current_value();
		if (old_tick == now_tick)
		{
			// CPU 太快了，导致再次进入循环后 old_tick == now_tick
			continue;
		}

		uint32_t delta_tick = 0;
		if (old_tick > now_tick)
		{
			// 因为是减计数，所以此时没有发生环绕
			delta_tick = old_tick - now_tick;
		}
		else
		{
			// 发生了环绕
			// delta_tick = old_tick - (now_tick - reload)
			// delta_tick = old_tick - now_tick + reload
			delta_tick = old_tick - now_tick + systick_reload_num();
		}

		total_tick += delta_tick;
		if (total_tick >= tick_count)
		{
			return;
		}

		old_tick = now_tick;
	}
}

void systick_nop_loop_delay_us(uint32_t us_count)
{
	uint32_t freq = systick_clock_source_freq();
	systick_nop_loop_delay_tick(freq / (uint32_t)1e6 * us_count);
}

void systick_nop_loop_delay_ms(uint32_t ms_count)
{
	for (uint32_t i = 0; i < ms_count; i++)
	{
		systick_nop_loop_delay_us(1000);
	}
}

void HAL_Delay(uint32_t Delay)
{
	systick_nop_loop_delay_ms(Delay);
}

uint8_t peripheral_clock_enabled(Peripheral p)
{
	switch (p)
	{
	case Peripheral_GPIO_A:
		{
			return __HAL_RCC_GPIOA_IS_CLK_ENABLED();
		}
	case Peripheral_GPIO_B:
		{
			return __HAL_RCC_GPIOB_IS_CLK_ENABLED();
		}
	case Peripheral_GPIO_C:
		{
			return __HAL_RCC_GPIOC_IS_CLK_ENABLED();
		}
	case Peripheral_GPIO_D:
		{
			return __HAL_RCC_GPIOD_IS_CLK_ENABLED();
		}
	}
}
